In [2]:
SSE=31.4348
SST=1257.33

SSR=SST-SSE

print('SSE=',SSE)
print('SSE=',SST)
print('SSE=',SSR)

SSE= 31.4348
SSE= 1257.33
SSE= 1225.8952

In [3]:
import pandas as pd
a={'x':[13,19,16,14,15,14],'y':[40,83,62,48,58,43]}
data=pd.DataFrame(a)
data

    x   y
0  13  40
1  19  83
2  16  62
3  14  48
4  15  58
5  14  43

In [4]:
data['x_2']=data['x']*data['x']
data

    x   y  x_2
0  13  40  169
1  19  83  361
2  16  62  256
3  14  48  196
4  15  58  225
5  14  43  196

In [5]:
data['y_2']=data['y']*data['y']
data

    x   y  x_2   y_2
0  13  40  169  1600
1  19  83  361  6889
2  16  62  256  3844
3  14  48  196  2304
4  15  58  225  3364
5  14  43  196  1849

In [6]:
data['xy']=data['x']*data['y']
data

    x   y  x_2   y_2    xy
0  13  40  169  1600   520
1  19  83  361  6889  1577
2  16  62  256  3844   992
3  14  48  196  2304   672
4  15  58  225  3364   870
5  14  43  196  1849   602

In [7]:
from sklearn import linear_model

In [9]:
linearregression=linear_model.LinearRegression()
linearregression.fit(X=pd.DataFrame(data['x']),y=data['y'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [14]:
print('a=',linearregression.intercept_)
a=linearregression.intercept_
print('b=',linearregression.coef_)
b=linearregression.coef_

a= -55.48175182481753
b= [7.32846715]

In [20]:
S=((data['y_2'].sum())-(a*data['y'].sum())-(b*data['xy'].sum()))/5
S

array([6.20729927])

In [22]:
data['y_hat']=[39.48,84.24,61.86,46.94,54.4,46.94]
data

    x   y  x_2   y_2    xy  y_hat
0  13  40  169  1600   520  39.48
1  19  83  361  6889  1577  84.24
2  16  62  256  3844   992  61.86
3  14  48  196  2304   672  46.94
4  15  58  225  3364   870  54.40
5  14  43  196  1849   602  46.94

In [23]:
data['y-y_hat']=data['y']-data['y_hat']
data

    x   y  x_2   y_2    xy  y_hat  y-y_hat
0  13  40  169  1600   520  39.48     0.52
1  19  83  361  6889  1577  84.24    -1.24
2  16  62  256  3844   992  61.86     0.14
3  14  48  196  2304   672  46.94     1.06
4  15  58  225  3364   870  54.40     3.60
5  14  43  196  1849   602  46.94    -3.94

In [24]:
data['(y-y_hat)_2']=data['y-y_hat']*data['y-y_hat']
data

    x   y  x_2   y_2    xy  y_hat  y-y_hat  (y-y_hat)_2
0  13  40  169  1600   520  39.48     0.52       0.2704
1  19  83  361  6889  1577  84.24    -1.24       1.5376
2  16  62  256  3844   992  61.86     0.14       0.0196
3  14  48  196  2304   672  46.94     1.06       1.1236
4  15  58  225  3364   870  54.40     3.60      12.9600
5  14  43  196  1849   602  46.94    -3.94      15.5236

In [25]:
data['y'].mean()

55.666666666666664

In [26]:
data['y-y_avg']=data['y']-data['y'].mean()
data

    x   y  x_2   y_2    xy  y_hat  y-y_hat  (y-y_hat)_2    y-y_avg
0  13  40  169  1600   520  39.48     0.52       0.2704 -15.666667
1  19  83  361  6889  1577  84.24    -1.24       1.5376  27.333333
2  16  62  256  3844   992  61.86     0.14       0.0196   6.333333
3  14  48  196  2304   672  46.94     1.06       1.1236  -7.666667
4  15  58  225  3364   870  54.40     3.60      12.9600   2.333333
5  14  43  196  1849   602  46.94    -3.94      15.5236 -12.666667

In [27]:
data['(y-y_avg)_2']=data['y-y_avg']*data['y-y_avg']
data

,x,y,x_2,y_2,xy,y_hat,y-y_hat,(y-y_hat)_2,y-y_avg,(y-y_avg)_2
0,13,40,169,1600,520,39.48,0.52,0.2704,-15.666667,245.444444
1,19,83,361,6889,1577,84.24,-1.24,1.5376,27.333333,747.111111
2,16,62,256,3844,992,61.86,0.14,0.0196,6.333333,40.111111
3,14,48,196,2304,672,46.94,1.06,1.1236,-7.666667,58.777778
4,15,58,225,3364,870,54.40,3.60,12.9600,2.333333,5.444444
5,14,43,196,1849,602,46.94,-3.94,15.5236,-12.666667,160.444444

In [29]:
SSE=data['(y-y_hat)_2'].sum()
SST=data['(y-y_avg)_2'].sum()

In [32]:
SSR=SST-SSE
SSR

1225.8985333333333

In [33]:
R_square=SSR/SST
R_square

0.9749988335100742

In [35]:
1-(SSE/SST)

0.9749988335100742

In [37]:
((data['y_hat']-data['y'].mean())**2).sum()

1270.7147999999997

In [39]:
data['y'].mean()

55.666666666666664

In [41]:
data['y_hat']-data['y']

0   -0.52
1    1.24
2   -0.14
3   -1.06
4   -3.60
5    3.94
dtype: float64

In [42]:

data = pd.DataFrame({'x1':[13,18,17,20,22,21],'x2':[9,7,17,11,8,10],'y':[20,22,30,27,35,32]})
data

   x1  x2   y
0  13   9  20
1  18   7  22
2  17  17  30
3  20  11  27
4  22   8  35
5  21  10  32

In [48]:
X=data[['x1','x2']]
y=data['y']

In [50]:
linear_regression = linear_model.LinearRegression()
linear_regression.fit(X=pd.DataFrame(X),y=y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [51]:
prediction = linear_regression.predict(X=pd.DataFrame(X))
prediction

array([18.33980044, 24.81208426, 29.51496674, 30.39966741, 31.61419069,
       31.31929047])

In [52]:
a=linear_regression.intercept_
b=linear_regression.coef_
print('a= ',a,'b=',b)

a=  -7.35920177383591 b= [1.5443459  0.62472284]

In [53]:
residuals=y-prediction
residuals.describe()

count    6.000000e+00
mean    -4.144833e-15
std      2.622371e+00
min     -3.399667e+00
25%     -1.987805e+00
50%      5.828714e-01
75%      1.415327e+00
max      3.385809e+00
Name: y, dtype: float64

In [54]:
SSE=(residuals**2).sum()
SST=((y-y.mean())**2).sum()
R_squared=1-(SSE/SST)
print('SSE = ',SSE,'\nSST = ',SST,'\nR_squared = ',R_squared)

SSE =  34.38414634146339
SST =  169.33333333333331
R_squared =  0.7969440176685232

In [55]:
from sklearn.metrics import mean_squared_error
print('score =',linear_regression.score(X=pd.DataFrame(X),y=y))
print('Mean_squared_Error = ',mean_squared_error(prediction,y))
print('RMSE = ',mean_squared_error(prediction,y)**0.5)

score = 0.7969440176685232
Mean_squared_Error =  5.730691056910565
RMSE =  2.393886182948255

In [56]:
new_data=pd.DataFrame({'x1':[25],'x2':[15]})
new_data

   x1  x2
0  25  15

In [61]:
new_sale=linear_regression.predict(X=new_data)
new_sale

array([40.62028825])

In [60]:
a+(b[0]*25)+(b[1]*15)

40.62028824833703